AutomotiveNegotiation2/IntelligentGW_SecureECU/ECU/board/pin_mux.h
/* GPIO_DISP_B1_09 (coord C13), ENET_RGMII_TXD0/U10[18]/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_CHANNEL                          0U   /*!< Signal channel */

/* GPIO_DISP_B1_10 (coord B14), ENET_RGMII_TX_EN/U10[19]/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TX_EN_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TX_EN_SIGNAL                  enet_tx_en   /*!< Signal name */

/* GPIO_DISP_B1_11 (coord A14), ENET_RGMII_TXC/U10[20]/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXC_PERIPHERAL                   ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXC_SIGNAL                enet_tx_clk_io   /*!< Signal name */

/* GPIO_DISP_B2_13 (coord A5), INT1_COMBO/BT_UART_RTS/U16[4]/U354[5]/ETHPHY_RST_B/U10[12] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_1G_RST_PERIPHERAL                       GPIO11   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_1G_RST_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_1G_RST_CHANNEL                             14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET1GPINS_ENET_1G_RST_GPIO                             GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET1GPINS_ENET_1G_RST_GPIO_PIN                            14U   /*!< GPIO pin number */
#define BOARD_INITENET1GPINS_ENET_1G_RST_GPIO_PIN_MASK               (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_19 (coord U2), ENET_RGMII_MDC */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDC_PERIPHERAL                   ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDC_SIGNAL                      enet_mdc   /*!< Signal name */

/* GPIO_EMC_B2_20 (coord R3), ENET_RGMII_MDIO */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDIO_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDIO_SIGNAL                    enet_mdio   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEnet1GPins(void);              /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_00 (coord J15), FlexSPI_B_D3/U21[E1] */
/* Routed pin properties */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D3_PERIPHERAL                      GPIO10   /*!< Peripheral name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D3_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D3_CHANNEL                             9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D3_GPIO                            GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D3_GPIO_PIN                            9U   /*!< GPIO pin number */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D3_GPIO_PIN_MASK               (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_01 (coord J14), FlexSPI_B_D2/U21[E2] */
/* Routed pin properties */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D2_PERIPHERAL                      GPIO10   /*!< Peripheral name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D2_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D2_CHANNEL                            10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D2_GPIO                            GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D2_GPIO_PIN                           10U   /*!< GPIO pin number */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D2_GPIO_PIN_MASK              (1U << 10U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_02 (coord H13), FlexSPI_B_D1/U21[E3] */
/* Routed pin properties */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D1_PERIPHERAL                      GPIO10   /*!< Peripheral name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D1_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D1_CHANNEL                            11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D1_GPIO                            GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D1_GPIO_PIN                           11U   /*!< GPIO pin number */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D1_GPIO_PIN_MASK              (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_03 (coord E15), FlexSPI_B_D0/U21[D5] */
/* Routed pin properties */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D0_PERIPHERAL                      GPIO10   /*!< Peripheral name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D0_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D0_CHANNEL                            12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D0_GPIO                            GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D0_GPIO_PIN                           12U   /*!< GPIO pin number */
#define BOARD_INITFUNCIOPINS_FlexSPI_B_D0_GPIO_PIN_MASK              (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_SNVS_00 (coord R10), J42[3] */
/* Routed pin properties */
#define BOARD_INITFUNCIOPINS_LED_RED_D1_PERIPHERAL                        GPIO13   /*!< Peripheral name */
#define BOARD_INITFUNCIOPINS_LED_RED_D1_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_INITFUNCIOPINS_LED_RED_D1_CHANNEL                               3U   /*!< Signal channel */

