AutomotiveNegotiation2/IntelligentGW_SecureECU/ECU/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITFUNCIOPINS_LED_RED_D5_GPIO                              GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITFUNCIOPINS_LED_RED_D5_GPIO_PIN                             11U   /*!< GPIO pin number */
#define BOARD_INITFUNCIOPINS_LED_RED_D5_GPIO_PIN_MASK                (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_SNVS_09 (coord R11), J42[12] */
/* Routed pin properties */
#define BOARD_INITFUNCIOPINS_LED_GREEN_D5_PERIPHERAL                      GPIO13   /*!< Peripheral name */
#define BOARD_INITFUNCIOPINS_LED_GREEN_D5_SIGNAL                         gpio_io   /*!< Signal name */
#define BOARD_INITFUNCIOPINS_LED_GREEN_D5_CHANNEL                            12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITFUNCIOPINS_LED_GREEN_D5_GPIO                            GPIO13   /*!< GPIO peripheral base pointer */
#define BOARD_INITFUNCIOPINS_LED_GREEN_D5_GPIO_PIN                           12U   /*!< GPIO pin number */
#define BOARD_INITFUNCIOPINS_LED_GREEN_D5_GPIO_PIN_MASK              (1U << 12U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFuncIoPins(void);              /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
